#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_disk.game_data_disk: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk]
google_compute_network.vpc_network: Refreshing state... [id=projects/minecraft-abekoh/global/networks/minecraft-network]
google_compute_address.static_ip: Refreshing state... [id=projects/minecraft-abekoh/regions/asia-northeast1/addresses/minecraft-server-static-ip]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-icmp]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-ssh]
google_compute_firewall.allow_minecraft: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-minecraft]
google_compute_instance.bot_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot]
google_compute_instance.vm_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.bot_instance has been changed
  ~ resource "google_compute_instance" "bot_instance" {
      ~ cpu_platform         = "Unknown CPU Platform" -> "Intel Haswell"
      ~ current_status       = "TERMINATED" -> "RUNNING"
        id                   = "projects/minecraft-abekoh/zones/us-central1-b/instances/minecraft-abekoh-discord-bot"
        name                 = "minecraft-abekoh-discord-bot"
        tags                 = []
        # (15 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
            # (4 unchanged attributes hidden)

          ~ access_config {
              + nat_ip       = "34.134.137.220"
                # (1 unchanged attribute hidden)
            }
        }



        # (4 unchanged blocks hidden)
    }
  # google_compute_instance.vm_instance has been changed
  ~ resource "google_compute_instance" "vm_instance" {
      ~ cpu_platform         = "Unknown CPU Platform" -> "Intel Broadwell"
      ~ current_status       = "TERMINATED" -> "RUNNING"
        id                   = "projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh"
        name                 = "minecraft-abekoh"
        tags                 = [
            "minecraft-server",
        ]
        # (15 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.backup will be created
  + resource "google_storage_bucket" "backup" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "minecraft-abekoh-backup"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 30
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abekoh, Action: `pull_request`, Working Directory: ``, Workflow: `validate & plan Terraform`*